/**************************************************
***** Матрица попарных сравнений для уровня 2 ***** 
***************************************************/

const lvl2mtrx = [[1,5,3,7,6,1/3,1/4],
                  [1/5,1,1/3,5,3,1/5,1/7],
                  [1/3,3,1,6,3,6,1/5],
                  [1/7,1/5,1/6,1,1/3,1/7,1/8],
                  [1/6,1/3,1/3,3,1,1/5,1/6],
                  [3,5,1/6,7,5,1,1/2],
                  [4,7,5,8,6,2,1]];

/**************************************************
***** Матрицы попарных сравнений для уровня 3 ***** 
***************************************************/

//Размер дома К1
const sizeOfHouse = [[1,6,8],
                    [1/6,1,4],
                    [1/8,1/4,1]];

//Удобное автобусное сообщение К2
const convenientBus = [[1,7,1/5],
                      [1/7,1,1/8],
                      [5,8,1]];

//Окрестности К3
const neighborhood = [[1,8,6],
                      [1/8,1,1/4],
                      [1/6,4,1]];
                      
//Когда построен дом К4
const whenBuilt = [[1,1,1],
                  [1,1,1],
                  [1,1,1]];

//Двор К5
const yard = [[1,5,4],
              [1/5,1,1/3],
              [1/4,3,1]];

//Общее состояние К7
const generalState = [[1,1/2,1/2],
                      [2,1,1],
                      [2,1,1]];

//Финансовые условия К8
const financialСonditions = [[1,1/7,1/5],
                            [7,1,3],
                            [5,1/3,1]];


module.exports = { lvl2mtrx, sizeOfHouse, convenientBus, neighborhood, whenBuilt, yard, generalState, financialСonditions };